int/resources/objectRepo/xmlTemplates/opera/MembershipConfig/req_CreateMembershipTypes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateMembershipTypesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:MembershipTypes>
            <v91:MembershipType AllowShares="?" BookerProgramYn="?" CentralSetupYn="?" CompanyYn="?" ContactYn="?" EnrollmentAddressAllowed="?" EnrollmentBirthdateAllowed="?" EnrollmentCodeRequiredYn="?" EnrollmentCommunicationAllowed="?" EnrollmentFeeAllowed="?" ExcludeProfileFromPurge="?" ExternallyControlled="?" GroupYn="?" Inactive="?" Multiplier="?" PrimaryMembership="?" PrintFolioMsgOnConfirmation="?" ReIssueNewCard="?" SendCheckoutToInterface="?" SourceYn="?" TravelAgentYn="?">
               <v91:MembershipType/>
               <v91:MembershipClass/>
               <v91:Description/>
               <v91:PointsLabel/>
               <v91:HasPointCalculationRule/>
               <v91:Sequence/>
               <v91:CardDetails AllowDuplicateCardNumbers="?" ChipAndPin="?" ExpirationDateRequired="?" ValidationByInterface="?">
                  <v91:MembershipCardValidationRule Rule="?">
                     <v91:Length/>
                     <v91:Prefix/>
                     <v91:Ranges>
                        <v91:Range>
                           <v91:From/>
                           <v91:To/>
                        </v91:Range>
                     </v91:Ranges>
                     <v91:Formula/>
                  </v91:MembershipCardValidationRule>
                  <v91:CardNumberBasedOn/>
                  <v91:Database/>
               </v91:CardDetails>
               <v91:Currency/>
               <v91:MembershipAction/>
               <v91:ExchangeType/>
               <v91:PointCost/>
               <v91:AttachMembershipToReservationRule/>
               <v91:MemberFolioMessage/>
               <v91:NonMemberFolioMessage/>
               <v91:FolioMessageFBAPosting/>
               <v91:AwardGenerationMethod/>
               <v91:AwardPointsDetail>
                  <v91:NonMemberPoints/>
                  <v91:DelayInDays/>
                  <v91:YearsToExpire/>
                  <v91:CalendarPeriod/>
                  <v91:ExpiryPeriod/>
                  <v91:ExpiryMonth/>
                  <v91:MonthsToAwardPointsExpiry/>
                  <v91:AwardPointsExpiryDate/>
                  <v91:AwardRedeemThreshold/>
                  <v91:ActivityPeriodMonths/>
                  <v91:ActivityPeriodYears/>
                  <v91:GracePeriodMonths/>
                  <v91:GracePeriodYear/>
                  <v91:RequiredOnStayPeriod/>
                  <v91:ExceptionCriteria>
                     <v91:MultipleRooms/>
                     <v91:BBSingleProperty/>
                     <v91:BBSingleGroup/>
                     <v91:BBCrossMembership/>
                     <v91:ExternalProcessingException/>
                  </v91:ExceptionCriteria>
               </v91:AwardPointsDetail>
               <v91:TierPointsDetails>
                  <v91:NonMemberPoints/>
                  <v91:BasedOn/>
                  <v91:TierExpirationMonth/>
                  <v91:RequalifyOnUpgrade/>
                  <v91:DowngradeRenewalInAutoJob/>
                  <v91:UpgradePeriodRolling/>
                  <v91:DowngradePeriodRolling/>
                  <v91:UpgradePeriodCalendar/>
                  <v91:DowngradePeriodCalendar/>
                  <v91:EnableTierManagementReset/>
               </v91:TierPointsDetails>
               <v91:AdditionalDetails>
                  <v91:EnrollmentLetter/>
                  <v91:AdhocStatement/>
                  <v91:BatchStatement/>
                  <v91:AutoWebEnrollment/>
                  <v91:AutoUpdateWebLogin/>
               </v91:AdditionalDetails>
               <v91:HandlingDetails>
                  <v91:ExternalDatabase/>
                  <v91:LevelRequired/>
                  <v91:Fulfillment/>
                  <v91:AllowCardNumberOverride/>
                  <v91:EnrollmentCodeRequired/>
                  <v91:SaveCardNumberHistory/>
                  <v91:StatementUDFSet/>
                  <v91:DefaultMembershipStatus/>
                  <v91:NameProtected/>
                  <v91:AlternateNameProtected/>
                  <v91:AutoGenerateReferenceNo/>
                  <v91:AutoPopulateNumberFromName/>
                  <v91:NameOnCardFromAltName/>
                  <v91:MoveMemPromotions/>
               </v91:HandlingDetails>
               <v91:MembershipLevels>
                  <v91:MembershipLevel>
                     <v91:Type/>
                     <v91:Code/>
                     <v91:Description/>
                     <v91:Label/>
                     <v91:Rank/>
                     <v91:VIP/>
                     <v91:DisplayColor/>
                     <v91:Inactive/>
                     <v91:FolioTexts>
                        <v91:HotelFolioTexts HotelCode="?">
                           <v91:FolioText1/>
                           <v91:FolioText2/>
                           <v91:FolioText3/>
                           <v91:FolioText4/>
                        </v91:HotelFolioTexts>
                     </v91:FolioTexts>
                     <v91:Fulfillment/>
                     <v91:ChangesRestricted/>
                     <v91:AutoRenewGrace/>
                     <v91:CardValidYears/>
                     <v91:RestrictedLevel/>
                     <v91:RenewCard/>
                     <v91:FeeRequired/>
                     <v91:MaxDowngradeLevel/>
                     <v91:NumberOfTransactions/>
                  </v91:MembershipLevel>
               </v91:MembershipLevels>
               <v91:EnrollmentMatchRule>
                  <v91:MembershipEnrollmentMatchRule/>
                  <v91:UserDefinedEnrollmentFields>
                     <v91:UserDefinedEnrollmentField>
                        <v91:FieldName/>
                        <v91:FieldType/>
                        <v91:RequiredField/>
                        <v91:Active/>
                     </v91:UserDefinedEnrollmentField>
                  </v91:UserDefinedEnrollmentFields>
                  <v91:AdvancedEnrollment/>
               </v91:EnrollmentMatchRule>
            </v91:MembershipType>
         </v9:MembershipTypes>
      </v9:CreateMembershipTypesRQ>
   </soapenv:Body>
</soapenv:Envelope>